# Course: QA Automation
# Week: 4
# Theme: Structured data types

# Modul 8. Structured data types
# ––––––––––––––––––––––––––––––––––––––––––––––––––––––––
# Task 7
# Створити список , який складатиметься з 10 значень цілого типу.
# Організувати введення цього списку з клавіатури.
# Серед елементів з непарними номерами знайдіть найбільший елемент списку, який ділиться
# на 3 без остачі. (Гарантовано, що в списокі є хоча б один непарний елемент, який ділиться на 3).
# ––––––––––––––––––––––––––––––––––––––––––––––––––––––––
# Dev: Artur Kychenko
# Date: 06.04.2023

mas = []
n = 10

for i in range(n):
    mas.append(int(input("Введіть значення:")))

for i in range(1, n, 2):
    if mas[i] % 3 == 0:
        ind = i

for i in range(1, n, 2):
    if (mas[i] % 3 == 0) and (mas[i] >= mas[ind]):
        ind = i

print(mas[ind])
