# Використовуючи спеціальний синтаксис — змінна, перед якою стоїть зірочка, — можна в цю змінну "запакувати" у вигляді списка "зайві" значення:
"""""
>>> a, b, *rest = range(10)
>>> a
0
>>> b
1
>>> rest
[2, 3, 4, 5, 6, 7, 8, 9]
>>>
>>> first, *middle, last = range(10)
>>> first
0
>>> last
9
>>> middle
[1, 2, 3, 4, 5, 6, 7, 8]
""" ""
# Змінні, які об'єднано в кортеж, також можуть стояти в заголовку цикла for. Створимо список кортежів кожен з двох елементів:

"""""
>>> tuples = [(x, y) for x in range(3) for y in range(3)]
>>> tuples
[(0, 0), (0, 1), (0, 2), (1, 0), (1, 1), (1, 2), (2, 0), (2, 1), (2, 2)]
>>> for x, y in tuples:
...     print(x, y)
...
0 0
0 1
0 2
1 0
1 1
1 2
2 0
2 1
2 2
>>>
""" ""
