# Курс: Prometheus - QA Automation
# Тиждень: 3
# Тема: Вказівка повторення (Вивчення циклів)

# Задача, яка обчислює кількість зерент пршениці,
# якщо на першу клітинку покласти 1 зернину
# а на кожній наступній клітинці к-ть зерен
# збільшується вдвічі в порівнянні з попередньою
sum = 0
addition = 1

for i in range(64):
    sum += addition
    addition *= 2
print("Кількість зерна =", sum)
